#Лаб1, завд5, Карпенко Ю.О., ЗПІ-18
#Задача: допогти Павлові розробити програму для розрахунку площі трикутника за формулою Герона

print("Помогите Павлу завершить доброе дело и напишите программу,\nвычисляющую площадь треугольника по переданным длинам трѐх его сторон по формуле Герона.")

import math

a = int(input("A = ")) #сторона
b = int(input("B = ")) #сторона
c = int(input("C = ")) #сторона

if c > (a + b) or a > (c + b) or b > (c + b) or c < (a - b) or a < (c - b) or b < (a - c): #Якщо умова невірна...
	print("Это не треугольник.") #Вивести відповідне повідомлення
else: #якщо все нормально...
	p = (a + b + c) / 2 #Розрахувати півпериметра
	S = math.sqrt(p * (p - a) * (p - b) * (p - c)) #Розрахувати площу
	print(S) #Вивести результат