# Дяченко В.В., ЗПІ-18
# Задача: допогти Павлові розробити програму для розрахунку площі трикутника за формулою Герона

import math
print(
    "Допоможіть Павлу завершити справу і винайдіть програму,\nяка обрахує площу трикутника по заданим 3-х сторонах за формулою Герона.")


a = int(input("A = "))  # сторона тут
b = int(input("B = "))  # сторона там
c = int(input("C = "))  # сторона тут і там

# Якщо умова невірна...
if c > (a + b) or a > (c + b) or b > (c + b) or c < (a - b) or a < (c - b) or b < (a - c):
    # Вивести відповідне повідомлення
    print("Ем, від таких значень геометрія відмовилася надати API для розрахунку :\.")
else:  # якщо все нормально...
    p = (a + b + c) / 2  # Розрахувати півпериметра
    S = math.sqrt(p * (p - a) * (p - b) * (p - c))  # Розрахувати площу
    print(S)  # Вивести результат
