# Дяченко В.В., ЗПІ-18

print("Катя дізналася, що їй для сну треба X хвилин.\nНа відміну від Миколи, Катя лягає спати пілся опівночі о H годин і M хвилин.\nДопоможіть Каті встановити будильник так,\nщоб він продзеленчав через X хвилин після того, як вона піде дивитися сни.\n")

# Через скільки хвилин прокинутись
X = int(input("Введи хвилини, через скільки прокинутися: "))

H = int(input("Годин: "))  # О котрій лягає спати (год)
M = int(input("Хвилин: "))  # (хв)

x = X + (H * 60 + M)  # Обрахунки

h = x // 60  # О котрій годині продзвенить будильник
m = x % 60  # Залишок хвилин

if x >= 1440:  # Якщо перевищено добу...
    # Вивести відповідне повідомлення
    print("\nЩо занадто то недобре :/ \n(Discord навіть у цей час не працює!)")
else:  # Якщо все нормально...
    print(h)  # Вивидиться година
    print(m)  # Та хвилини
