# Дяченко В.В., ЗПІ-18
# Написати програму, що приймає на вхід ціле число, що виводить True, якщо значення попадає в інтервал (−15,12]∪(14,17)∪[19,+∞) та False в іншому випадку.

print(
    "Напишіть програму, яка приймає ціле число,\nяка скаже True, якщо це число влучає у\nцей інтервал (−15,12]∪(14,17)∪[19,+∞) и False якщо промазало число.\n")

a = int(input("Введи число: "))  # Наше число (чи не наше...)

# Якщо число задовільняє умову...
if (a > 15 and a <= 12) or (a > 14 and a < 17) or (a >= 19):
    print("True")  # Вивести позиивну відповідь
else:  # Якщо ж не задовільняє...
    print("False")  # Вивести негативну відповідь
