#Лаб1, завд7, Карпенко Ю.О., ЗПІ-18
#Написати програму, що отримує на вхід три цілі числа, по одному числу в рядку, і виводить у консоль в три рядки спочатку максимальне, потім мінімальне, після чого число, що залишилося.

print("Напишите программу,\nкоторая получает на вход три целых числа, по одному числу в строке,\nи выводит на консоль в три строки сначала максимальное, потом минимальное,\nпосле чего оставшееся число.\n")

a = int(input("a = ")) #Число
b = int(input("b = ")) #Число
c = int(input("c = ")) #Число

U = [a, b, c] #Множина наших чисел

print(max(U)) #Максимальне
print(min(U)) #Мінімальне
#Число, що залишилось:
if (a <= b and a >= c) or (a <= c and a >= b):
	print(a)
elif (b <= a and b >= c) or (b <= c and b >= a):
	print(b)
else:
	print(c)