# Дяченко В.В., ЗПІ-18

print("Микола хоче поставити будильника так,\nщоб він спрацював рівно через X хвилин після опівночі,\nале для цього необхідно вказати час сигналу у форматі години, хвилин.\nДопоможіть Миколі визначити, на котру годину йому завести будильник.\n")

X = int(input("Введіть к-сть хвилин: "))  # Користувач вводить кількість хвилин

h = X // 60  # Підрахунки в годинах
m = X % 60  # Хвилини

if X >= 1440:  # Якщо хвилин як в добі або навіть більше,..
    # Виводиться відповідне повідомлення
    print("\nВибач, але у нас Земний час, не Юпітерський :/")
else:  # Якщо ж все нормально,..
    print(h)  # Вивидиться година
    print(m)  # Та хвилини
