# Лаб1, завд2, <вставити П.І.Б. тут>, ЗПІ-18
# Задача: Допоможіть Миколі визначити, на який час навести будильник.
# Години та хвилини мають бути на різних рядках.

print("Коля хочет поставить себе будильник так,\nчтобы он прозвенел ровно через X минут после полуночи,\nоднако для этого необходимо указать время сигнала в формате часы, минуты.\nПомогите Коле определить, на какое время завести будильник.\n")

X = int(input("X = "))  # Користувач вводить кількість хвилин

h = X // 60  # Підрахунки в годинах
m = X % 60  # Хвилини

if X >= 1440:  # Якщо хвилин як в добі або навіть більше,..
    print("\nЧто-то поздновато...")  # Виводиться відповідне повідомлення
else:  # Якщо ж все нормально,..
    print(h)  # Вивидиться година
    print(m)  # Та хвилини
