# Дяченко В.В., ЗПІ-18

print("Вкажіть рік, який Вас так зацікавив (діапазон: 1900-3000)\n")

year = int(input("Рік: "))  # вводимо рік, який так зацікавив...

if year < 1900 and year > 3000:
    print("\nНажаль навіть квантовий комп'ютер не досяг потрібної потужності :/")
elif year % 4 == 0 and year % 100 != 0 or year % 400 == 0:  # відбуваються надзвичайно складні розрахунки
    print("\nВисокосний (вітаю, чекаєте Нового року на один день довше ^^")
else:
    print("\nЗвичайний (як і наше життя...)")
