#Лаб1, завд3, Карпенко Ю.О., ЗПІ-18
#Задача: Катерина лягає спати о H годині M хвилин
#Допомогти Катерині визначити на який час поставити будильник
#Гарантується, що Катерина має прокинутися в той же день, що й заснути

print("Катя узнала, что ей для сна надо X минут.\nВ отличие от Коли, Катя ложится спать после полуночи в H часов и M минут.\nПомогите Кате определить, на какое время ей поставить будильник,\nчтобы он прозвенел ровно через X минут после того, как она ляжет спать.\n")

X = int(input("X = ")) #Через скільки хвилин прокинутись

H = int(input("H = ")) #О котрій лягає спати (год)
M = int(input("M = ")) #(хв)

x = X + (H * 60 + M) #Обрахунки

h = x // 60 #О котрій годині продзвенить будильник
m = x % 60 #Залишок хвилин

if x >= 1440: #Якщо перевищено добу...
	print("\nЧто-то слишком...") #Вивести відповідне повідомлення
else: #Якщо все нормально...
	print(h) #Вивидиться година
	print(m) #Та хвилини