# Лаб1, завд1, <Вставити П.І.Б. тут>, ЗПІ-18
# Задача: Тимофій спить вночі X годин, ті вдень Y хвилин.
# Питання: Скільки всього хвилин спить Тимофій?

print("Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут.\nОпределите, сколько всего минут Тимофей спит в сутки.\n")

X = int(input("X = "))  # Скільки годин Тимофій спить вночі
Y = int(input("Y = "))  # Скільки хвилин Тимофій спить удень
Res = X * 60 + Y  # Обрахунки (в хвилинах)

if Res >= 1440:  # Якщо кількість вхилин перевищує добову,..
    print("В сутках столько нету :)")  # виводиться відповідне повідомлення
else:  # якщо ж все нормально,..
    print("\nТимофей спит", Res, "минут в сутки.")  # виводиться результат
