#Лаб1, завд6, Карпенко Ю.О., ЗПІ-18
#Написати програму, що приймає на вхід ціле число, що виводить True, якщо значення попадає в інтервал (−15,12]∪(14,17)∪[19,+∞) та False в іншому випадку.

print("Напишите программу, принимающую на вход целое число,\nкоторая выводит True, если переданное значение попадает\nв интервал (−15,12]∪(14,17)∪[19,+∞) и False в противном случае.\n")

a = int(input("Введите число: ")) #Наше число

if (a > 15 and a <= 12) or (a > 14 and a < 17) or (a >= 19): #Якщо число задовільняє умову...
	print("True") #Вивести позиивну відповідь
else: #Якщо ж не задовільняє...
	print("False") #Вивести негативну відповідь