#Лаб4, завд2, Карпенко Ю.О., ЗПІ-18
#Написати програму, що перевіряє правильність множення

input = open('input2.txt', 'r') #відкриття файлу з вхідними даними
output = open('output2.txt', 'w') #відкриття порожнього файлу, куди буде надіслано результат

U = input.read().split() #зчитування та заповнення масиву

print(U)

if int(U[0]) > 10 ** 2 or int(U[1]) > 10 ** 2 or int(U[2]) > 10 ** 6: #перевірка діапазону
	output.write("Числа виходять за рамки дыапазону!")
else:
	if int(U[0]) * int(U[1]) == int(U[2]): #перевірка на правильність множення
		output.write("YES")
	else:
		output.write("NO")

input.close() #закриття файлу з вхідними даними
output.close() #закриття файлу з результатом