# Дяченко В.В., ЗПІ-18
# Написати програму для розрахунку площі

import math

print("Оберіть форму кімнати:\n-трикутник\n-прямокутник\n-коло\n")

form = input("Геометрична форма кімнати: ")  # вибір форми

if form == "трикутник":  # обрахунки для трикутника
    a = float(input("A = "))
    b = float(input("B = "))
    c = float(input("C = "))
    p = (a + b + c) / 2
    S = math.sqrt(p * (p - a) * (p - b) * (p - c))
    print(S)
elif form == "прямокутник":  # обрахунки для прямокутника
    a = float(input("A = "))
    b = float(input("B = "))
    S = a * b
    print(S)
elif form == "коло":  # обрахунки для кола (чи круга?)
    r = float(input("R = "))
    S = 3.14 * r ** 2
    print(S)
else:
    # у випадку помилки введення форми
    print("Геометрія ще не винайшла таку форму або ти ввів магічні числа :/")
