#Лаб2, завд6, Карпенко Ю.О., ЗПІ-18
#Написати програму, що розраховує мінімум, на скільки шматочків потрібно розрізати пиріг

a = int(input("біологи: ")) #кількість учасників в команді біологів
b = int(input("інформатики: ")) # кількість учасників в команді інформатиків

pie_a = a
pie_b = b

while pie_a != pie_b: #доки к-ть шматочків не рівна, повторювати наступний алгоритм:
	if pie_a > pie_b: #якщо в біологів більше...
		pie_b += b #збільшити для інформатиків
	else:
		pie_a += a #і навпаки. Доки не зрівняються

print(pie_a) #вивести результат