#Лаб3, завд1, Каренко Ю.О., ЗПІ-18
#Написати програму, що рахує квадрат числа, що закінчується на 5, альтернативним способом

input = open('input1.txt', 'r') #відкриття файлу з вхідними даними
output = open('output1.txt', 'w') #відкриття порожнього файлу, куди буде надіслано результат
n = int(input.read()) #зчитування даних
if n % 10 == 5 and n < (4 * (10 ** 5)): #перевірка умови (число має закінчуватись на 5)
	res = (n // 10) * (n // 10 + 1) * 100 + 25 #обрахунки
	output.write(str(res)) #відправка результату у відповідний файл
else:
	print("Число не відповідає умовам програми!") #якщо число в файлі з вхідними даними не задовільняє умову, вивести відповідне повідомлення
input.close() #закриття файлу з вхідними даними
output.close() #закриття файлу з результатом