# Дяченко В.В., ЗПІ-18
# Написати програму для вигравання у грі "Вгадайка" (Увага! Не махлювати за допомогою цього ПЗ!)

input = open('input2.txt', 'r')  # відкриття файлу з вхідними даними
# відкриття порожнього файлу, куди буде надіслано результат
output = open('output2.txt', 'w')

n = int(input.read())  # зчитування даних

if n <= 9 and n > 0:
    res = n * 100 + 90 + (9 - n)  # обрахунки
    output.write(str(res))  # відправка результату у відповідний файл
else:
    # якщо число в файлі з вхідними даними не задовільняє умову, вивести відповідне повідомлення
    print("Число не відповідає умовам програми! Для чого програміст старався?")

input.close()  # закриття файлу з вхідними даними
output.close()  # закриття файлу з результатом
