#Лаб3, завд2, Каренко Ю.О., ЗПІ-18
#Написати програму для вигравання у грі "Вгадайка"

input = open('input2.txt', 'r') #відкриття файлу з вхідними даними
output = open('output2.txt', 'w') #відкриття порожнього файлу, куди буде надіслано результат

n = int(input.read()) #зчитування даних

if n <= 9 and n > 0:
	res = n * 100 + 90 + (9 - n) #обрахунки
	output.write(str(res)) #відправка результату у відповідний файл
else:
	print("Число не відповідає умовам програми!") #якщо число в файлі з вхідними даними не задовільняє умову, вивести відповідне повідомлення

input.close() #закриття файлу з вхідними даними
output.close() #закриття файлу з результатом